## PRACTICE EXERCISE

**Objective:**
Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.

**Perform the following tasks:**
1. Create a new table named `Books`, with the following columns:
  * BookID (Primary Key, Auto-increment)
  * Title (Title of the book)
  * Author (Author of the book)
  * Genre (Genre of the book)
  * Publication_Year (Year of publication)
  * Price (Price of the Book)
2. Insert at least 3 new books into the `Books` table.
3. Retrieve all books from the Books table.
4. Update the price of a specific book.
5. Delete a book from the table.

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///sql-crud-exercise-database.db

In [3]:
%%sql
CREATE TABLE IF NOT EXISTS Books (
    Book_id INT PRIMARY KEY,
    Title VARCHAR(50) NOT NULL,
    Author VARCHAR(50) NOT NULL,
    Genre VARCHAR(50),
    Publication_Year DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sql-crud-exercise-database.db
Done.

[]

In [4]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sql-crud-exercise-database.db
Done.

[('Books',)]

In [5]:
%sql PRAGMA table_info('Books');

 * sqlite:///sql-crud-exercise-database.db
Done.

[(0, 'Book_id', 'INT', 0, None, 1),
 (1, 'Title', 'VARCHAR(50)', 1, None, 0),
 (2, 'Author', 'VARCHAR(50)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 0, None, 0),
 (4, 'Publication_Year', 'DECIMAL(10, 2)', 1, None, 0)]

In [6]:
%%sql ALTER TABLE Books
ADD Price INT

 * sqlite:///sql-crud-exercise-database.db
Done.

[]

In [7]:
%sql PRAGMA table_info('Books');

 * sqlite:///sql-crud-exercise-database.db
Done.

[(0, 'Book_id', 'INT', 0, None, 1),
 (1, 'Title', 'VARCHAR(50)', 1, None, 0),
 (2, 'Author', 'VARCHAR(50)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 0, None, 0),
 (4, 'Publication_Year', 'DECIMAL(10, 2)', 1, None, 0),
 (5, 'Price', 'INT', 0, None, 0)]

In [8]:
%%sql
INSERT INTO Books (Book_id, Title, Author, Genre, Publication_Year, Price)
VALUES (100, 'Chamber Secret', 'JK Rowling', 'Fantasy', '2008', 12);
INSERT INTO Books (Book_id, Title, Author, Genre, Publication_Year, Price) 
VALUES (220, 'One Piece', 'Echiro Oda', 'Anime', '1999', 13);
INSERT INTO Books (Book_id, Title, Author, Genre, Publication_Year, Price)
VALUES (420, 'Mockingjay', 'Suzanne Collins', 'Dystopian', '2010', 15);

 * sqlite:///sql-crud-exercise-database.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%sql SELECT * FROM Books;

 * sqlite:///sql-crud-exercise-database.db
Done.

[(100, 'Chamber Secret', 'JK Rowling', 'Fantasy', 2008, 12),
 (220, 'One Piece', 'Echiro Oda', 'Anime', 1999, 13),
 (420, 'Mockingjay', 'Suzanne Collins', 'Dystopian', 2010, 15)]

In [10]:
%%sql SELECT Title, Author, Genre
FROM Books;

 * sqlite:///sql-crud-exercise-database.db
Done.

[('Chamber Secret', 'JK Rowling', 'Fantasy'),
 ('One Piece', 'Echiro Oda', 'Anime'),
 ('Mockingjay', 'Suzanne Collins', 'Dystopian')]

In [11]:
%%sql UPDATE Books
SET Price = 100
WHERE Book_id = 100;

 * sqlite:///sql-crud-exercise-database.db
1 rows affected.

[]

In [12]:
%sql SELECT * FROM Books;

 * sqlite:///sql-crud-exercise-database.db
Done.

[(100, 'Chamber Secret', 'JK Rowling', 'Fantasy', 2008, 100),
 (220, 'One Piece', 'Echiro Oda', 'Anime', 1999, 13),
 (420, 'Mockingjay', 'Suzanne Collins', 'Dystopian', 2010, 15)]

In [13]:
%%sql DELETE FROM Books
WHERE Book_id = 100;

 * sqlite:///sql-crud-exercise-database.db
1 rows affected.

[]

In [15]:
%sql SELECT * FROM Books;

 * sqlite:///sql-crud-exercise-database.db
Done.

[(220, 'One Piece', 'Echiro Oda', 'Anime', 1999, 13),
 (420, 'Mockingjay', 'Suzanne Collins', 'Dystopian', 2010, 15)]